IDENTIFICATION DIVISION.
PROGRAM-ID. fizzbuzz.

DATA DIVISION.
 WORKING-STORAGE SECTION.
   01 DATA1 PIC 9(3).
   01 FILLER PIC X(3).
   01 DATA2 PIC 9(3).
   01 FILLER PIC X(3).
   01 DATA3 PIC 9(3) VALUE 0.
   01 FILLER PIC X(3).
   01 DATA4 PIC 9(3).

 PROCEDURE DIVISION.
  MAIN SECTION.

  *> PERFORM 〇〇 TIMES
    PERFORM 50 TIMES 
    ADD 1 TO DATA1 
    DIVIDE DATA1 BY 3 GIVING DATA2 REMAINDER DATA3
    DIVIDE DATA1 BY 5 GIVING DATA2 REMAINDER DATA4
    IF DATA3=0 AND DATA4=0 THEN
      DISPLAY "FIZZBUZZ"
    ELSE IF DATA3=0 THEN 
      DISPLAY "FIZZ"
    ELSE IF DATA4=0 THEN
      DISPLAY "BUZZ"
    ELSE
      DISPLAY 0
    END-PERFORM 
    
  *> PERFORM UNTIL 条件
    PERFORM UNTIL DATA1 > 50
    ADD 1 TO DATA1 
    DIVIDE DATA1 BY 3 GIVING DATA2 REMAINDER DATA3
    DIVIDE DATA1 BY 5 GIVING DATA2 REMAINDER DATA4
    IF DATA3=0 AND DATA4=0 THEN
      DISPLAY "FIZZBUZZ"
    ELSE IF DATA3=0 THEN 
      DISPLAY "FIZZ"
    ELSE IF DATA4=0 THEN
      DISPLAY "BUZZ"
    ELSE
      DISPLAY 0
    END-PERFORM 

  *> PERFORM VARYING 条件 UNTIL 条件
     PERFORM VARYING DATA1 FROM 1 BY 1 UNTIL DATA1 > 50
      DIVIDE DATA1 BY 3 GIVING DATA2 REMAINDER DATA3
      DIVIDE DATA1 BY 5 GIVING DATA2 REMAINDER DATA4
      IF DATA3=0 AND DATA4=0 THEN
         DISPLAY "FIZZBUZZ"
      ELSE IF DATA3=0 THEN
        DISPLAY "FIZZ"
      ELSE IF DATA4=0 THEN
        DISPLAY "BUZZ"
      ELSE
        DISPLAY 0
    END-PERFORM.

   STOP RUN.



