
IDENTIFICATION DIVISION.
PROGRAM-ID. HAMBURGER-SHOP.


ENVIRONMENT DIVISION.
   INPUT-OUTPUT SECTION.
      FILE-CONTROL.
         SELECT OUT-FILE ASSIGN TO "receipt.txt"
            ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.

   FILE SECTION.
      FD OUT-FILE LABEL RECORD STANDARD.
         01 OUT-FILE-REC.
            02 OUT-MENU PIC X(50).
            02 OUT-PAY-MONEY PIC 9(5).
            02 OUT-RETURN-MONEY PIC 9(5).


   WORKING-STORAGE SECTION.
      01 RECEIPT.
         03 SET-INFORMATION PIC X(50).
         03 FAIL-MONEY PIC 9(5).
         03 PAY-MONEY PIC 9(5).
         03 RETURN-MONEY PIC 9(5).

      01 SET-MENU.
         03 SET-HAMBURGER OCCURS 6 PIC X(50).
            
         
PROCEDURE DIVISION.

MAIN SECTION.

   MOVE "1.CHEESE BURGER SET" TO SET-HAMBURGER(1).
   MOVE "2.BLT BURGER SET" TO SET-HAMBURGER(2).
   MOVE "3.BIGMAC BURGER SET" TO SET-HAMBURGER(3).
   MOVE "4.CHICKEN BURGER SET" TO SET-HAMBURGER(4).
   MOVE "5.RICE BURGER SET" TO SET-HAMBURGER(5).
   MOVE "6.TERIYAKI BURGER SET" TO SET-HAMBURGER(6).

   DISPLAY 'WELCOME !!'.
   DISPLAY "CHOOSE THE MENU".
   DISPLAY SET-MENU.
   ACCEPT SET-INFORMATION.

   EVALUATE SET-INFORMATION
      WHEN 1

         MOVE "CHEESE BURGER SET" TO SET-INFORMATION
         DISPLAY "ORDER IS " SET-INFORMATION
         DISPLAY "580 YEN DESU!!"
         ACCEPT PAY-MONEY

         IF PAY-MONEY > 580 THEN 

            SUBTRACT PAY-MONEY FROM 580 GIVING RETURN-MONEY
            DISPLAY "RETURN IS " RETURN-MONEY " YEN DESU!!"
            OPEN OUTPUT OUT-FILE
               MOVE SET-INFORMATION TO OUT-MENU
               MOVE PAY-MONEY TO OUT-PAY-MONEY
               MOVE RETURN-MONEY TO OUT-RETURN-MONEY
               WRITE OUT-FILE-REC
               DISPLAY OUT-MENU
               DISPLAY OUT-PAY-MONEY
               DISPLAY OUT-RETURN-MONEY
            CLOSE OUT-FILE
            DISPLAY "ADIOUS!!"

         ELSE IF PAY-MONEY = 580 THEN 

            DISPLAY "NOT RETURN MONEY"
            OPEN OUTPUT OUT-FILE
               MOVE SET-INFORMATION TO OUT-MENU
               MOVE PAY-MONEY TO OUT-PAY-MONEY
               MOVE RETURN-MONEY TO OUT-RETURN-MONEY
               WRITE OUT-FILE-REC
               DISPLAY OUT-MENU
               DISPLAY OUT-PAY-MONEY
               DISPLAY OUT-RETURN-MONEY
            CLOSE OUT-FILE
            DISPLAY "ADIOUS!!"

         ELSE IF PAY-MONEY < 580 THEN 
            SUBTRACT PAY-MONEY FROM 580 GIVING FAIL-MONEY
            DISPLAY FAIL-MONEY " YEN TARINAI"
            DISPLAY "ADIOUS!!"
         END-IF
   END-EVALUATE

   EVALUATE SET-INFORMATION
      WHEN 2
         MOVE "BLT BURGER SET" TO SET-INFORMATION
         DISPLAY "ORDER IS " SET-INFORMATION
         DISPLAY "550 YEN DESU!!"
         ACCEPT PAY-MONEY

         IF PAY-MONEY > 550 THEN 

            SUBTRACT PAY-MONEY FROM 550 GIVING RETURN-MONEY
            DISPLAY "RETURN " RETURN-MONEY " YEN DESU!!"
            OPEN OUTPUT OUT-FILE
               MOVE SET-INFORMATION TO OUT-MENU
               MOVE PAY-MONEY TO OUT-PAY-MONEY
               MOVE RETURN-MONEY TO OUT-RETURN-MONEY
               WRITE OUT-FILE-REC
               DISPLAY OUT-MENU
               DISPLAY OUT-PAY-MONEY
               DISPLAY OUT-RETURN-MONEY
            CLOSE OUT-FILE
            DISPLAY "ADIOUS!!"

         ELSE IF PAY-MONEY = 550 THEN 

            DISPLAY "NOT RETURN MONEY"
            OPEN OUTPUT OUT-FILE
               MOVE SET-INFORMATION TO OUT-MENU
               MOVE PAY-MONEY TO OUT-PAY-MONEY
               MOVE RETURN-MONEY TO OUT-RETURN-MONEY
               WRITE OUT-FILE-REC
               DISPLAY OUT-MENU
               DISPLAY OUT-PAY-MONEY
               DISPLAY OUT-RETURN-MONEY
            CLOSE OUT-FILE
            DISPLAY "ADIOUS!!"

         ELSE IF PAY-MONEY < 550 THEN 
            SUBTRACT PAY-MONEY FROM 550 GIVING FAIL-MONEY
            DISPLAY FAIL-MONEY " YEN TARINAI"
            DISPLAY "ADIOUS!!"
         END-IF
   END-EVALUATE

   EVALUATE SET-INFORMATION
      WHEN 3
         MOVE "BIGMAC BURGER SET" TO SET-INFORMATION
         DISPLAY "ORDER IS " SET-INFORMATION
         DISPLAY "780 YEN DESU!!"
         ACCEPT PAY-MONEY

         IF PAY-MONEY > 780 THEN 

            SUBTRACT PAY-MONEY FROM 780 GIVING RETURN-MONEY
            DISPLAY "RETURN " RETURN-MONEY " YEN DESU!!"
            OPEN OUTPUT OUT-FILE
               MOVE SET-INFORMATION TO OUT-MENU
               MOVE PAY-MONEY TO OUT-PAY-MONEY
               MOVE RETURN-MONEY TO OUT-RETURN-MONEY
               WRITE OUT-FILE-REC
               DISPLAY OUT-MENU
               DISPLAY OUT-PAY-MONEY
               DISPLAY OUT-RETURN-MONEY
            CLOSE OUT-FILE
            DISPLAY "ADIOUS!!"

         ELSE IF PAY-MONEY = 780 THEN 

            DISPLAY "NOT RETURN MONEY"
            OPEN OUTPUT OUT-FILE
               MOVE SET-INFORMATION TO OUT-MENU
               MOVE PAY-MONEY TO OUT-PAY-MONEY
               MOVE RETURN-MONEY TO OUT-RETURN-MONEY
               WRITE OUT-FILE-REC
               DISPLAY OUT-MENU
               DISPLAY OUT-PAY-MONEY
               DISPLAY OUT-RETURN-MONEY
            CLOSE OUT-FILE
            DISPLAY "ADIOUS!!"

         ELSE IF PAY-MONEY < 780 THEN 

            SUBTRACT PAY-MONEY FROM 780 GIVING FAIL-MONEY
            DISPLAY FAIL-MONEY " YEN TARINAI"
            DISPLAY "ADIOUS!!"

         END-IF
   END-EVALUATE

   EVALUATE SET-INFORMATION
      WHEN 4
         MOVE "CHICKEN BURGER SET" TO SET-INFORMATION
         DISPLAY "ORDER IS " SET-INFORMATION
         DISPLAY "620 YEN DESU!!"
         ACCEPT PAY-MONEY

         IF PAY-MONEY > 620 THEN 

            SUBTRACT PAY-MONEY FROM 620 GIVING RETURN-MONEY
            DISPLAY "RETURN " RETURN-MONEY " YEN DESU!!"
            OPEN OUTPUT OUT-FILE
               MOVE SET-INFORMATION TO OUT-MENU
               MOVE PAY-MONEY TO OUT-PAY-MONEY
               MOVE RETURN-MONEY TO OUT-RETURN-MONEY
               WRITE OUT-FILE-REC
               DISPLAY OUT-MENU
               DISPLAY OUT-PAY-MONEY
               DISPLAY OUT-RETURN-MONEY
            CLOSE OUT-FILE
            DISPLAY "ADIOUS!!"

         ELSE IF PAY-MONEY = 620 THEN 

            DISPLAY "NOT RETURN MONEY"
            OPEN OUTPUT OUT-FILE
               MOVE SET-INFORMATION TO OUT-MENU
               MOVE PAY-MONEY TO OUT-PAY-MONEY
               MOVE RETURN-MONEY TO OUT-RETURN-MONEY
               WRITE OUT-FILE-REC
               DISPLAY OUT-MENU
               DISPLAY OUT-PAY-MONEY
               DISPLAY OUT-RETURN-MONEY
            CLOSE OUT-FILE
            DISPLAY "ADIOUS!!"

         ELSE IF PAY-MONEY < 620 THEN 

            SUBTRACT PAY-MONEY FROM 620 GIVING FAIL-MONEY
            DISPLAY FAIL-MONEY " YEN TARINAI"
            DISPLAY "ADIOUS!!"

         END-IF
   END-EVALUATE

   EVALUATE SET-INFORMATION
      WHEN 5
         MOVE "RICE BURGER SET" TO SET-INFORMATION
         DISPLAY "ORDER IS " SET-INFORMATION
         DISPLAY "550 YEN DESU!!"
         ACCEPT PAY-MONEY

         IF PAY-MONEY > 550 THEN 

            SUBTRACT PAY-MONEY FROM 550 GIVING RETURN-MONEY
            DISPLAY "RETURN " RETURN-MONEY " YEN DESU!!"
            OPEN OUTPUT OUT-FILE
               MOVE SET-INFORMATION TO OUT-MENU
               MOVE PAY-MONEY TO OUT-PAY-MONEY
               MOVE RETURN-MONEY TO OUT-RETURN-MONEY
               WRITE OUT-FILE-REC
               DISPLAY OUT-MENU
               DISPLAY OUT-PAY-MONEY
               DISPLAY OUT-RETURN-MONEY
            CLOSE OUT-FILE
            DISPLAY "ADIOUS!!"

         ELSE IF PAY-MONEY = 550 THEN 

            DISPLAY "NOT RETURN MONEY"
            OPEN OUTPUT OUT-FILE
               MOVE SET-INFORMATION TO OUT-MENU
               MOVE PAY-MONEY TO OUT-PAY-MONEY
               MOVE RETURN-MONEY TO OUT-RETURN-MONEY
               WRITE OUT-FILE-REC
               DISPLAY OUT-MENU
               DISPLAY OUT-PAY-MONEY
               DISPLAY OUT-RETURN-MONEY
            CLOSE OUT-FILE
            DISPLAY "ADIOUS!!"

         ELSE IF PAY-MONEY < 550 THEN 

            SUBTRACT PAY-MONEY FROM 550 GIVING FAIL-MONEY
            DISPLAY FAIL-MONEY " YEN TARINAI"
            DISPLAY "ADIOUS!!"

         END-IF
   END-EVALUATE

   EVALUATE SET-INFORMATION
      WHEN 6
         MOVE "TERIYAKI BURGER SET" TO SET-INFORMATION
         DISPLAY "ORDER IS " SET-INFORMATION
         DISPLAY "650 YEN DESU!!"
         ACCEPT PAY-MONEY

         IF PAY-MONEY > 650 THEN 

            SUBTRACT PAY-MONEY FROM 650 GIVING RETURN-MONEY
            DISPLAY "RETURN " RETURN-MONEY " YEN DESU!!"
            OPEN OUTPUT OUT-FILE
               MOVE SET-INFORMATION TO OUT-MENU
               MOVE PAY-MONEY TO OUT-PAY-MONEY
               MOVE RETURN-MONEY TO OUT-RETURN-MONEY
               WRITE OUT-FILE-REC
               DISPLAY OUT-MENU
               DISPLAY OUT-PAY-MONEY
               DISPLAY OUT-RETURN-MONEY
            CLOSE OUT-FILE
            DISPLAY "ADIOUS!!"

         ELSE IF PAY-MONEY = 650 THEN 

            DISPLAY "NOT RETURN MONEY"
            OPEN OUTPUT OUT-FILE
               MOVE SET-INFORMATION TO OUT-MENU
               MOVE PAY-MONEY TO OUT-PAY-MONEY
               MOVE RETURN-MONEY TO OUT-RETURN-MONEY
               WRITE OUT-FILE-REC
               DISPLAY OUT-MENU
               DISPLAY OUT-PAY-MONEY
               DISPLAY OUT-RETURN-MONEY
            CLOSE OUT-FILE
            DISPLAY "ADIOUS!!"

         ELSE IF PAY-MONEY < 650 THEN 

            SUBTRACT PAY-MONEY FROM 650 GIVING FAIL-MONEY
            DISPLAY FAIL-MONEY " YEN TARINAI"
            DISPLAY "ADIOUS!!"

         END-IF
   END-EVALUATE.



